# перечень правильных паролей
s = ['12', '13', '1423', '121524', '162534', '13172635', '1218273645', '141923283746', '11029384756', '12131511124210394857', '112211310495867', '1611325212343114105968', '1214114232133124115106978', '1317115262143531341251161079', '11621531441351261171089', '12151811724272163631545414513612711810', '118217316415514613712811910', '13141911923282183731746416515614713812911']

# загатовка для решения с вводимым значением
#k = int(input('Укажите число от 3 до 20: '))

# перебор всех возможных вариантов
for k in range(3, 21):
    # основной алгоритм
    password = []
    for i in range(1, k-1):
        for j in range(i+1, k):
            if k % (i + j) == 0:
                password.append(str(i))
                password.append(str(j))
    print('______Алгоритм:', ''.join(password))
    print('Верное решение:', s[k-3])
    if ''.join(password) in s:
        print(f'{k}: Вы остались живы')
    else:
        print(f'{k}: Аминь')
    print()

# оно работает!
